In [84]:
import pandas as pd

In [85]:
path_school = "../../../Classwork/vu-nsh-data-pt-02-2020-u-c/04-Pandas/Homework/PyCitySchools/Resources/schools_complete.csv"
path_student = "../../../Classwork/vu-nsh-data-pt-02-2020-u-c/04-Pandas/Homework/PyCitySchools/Resources/students_complete.csv"

schools_df = pd.read_csv(path_school)
students_df = pd.read_csv(path_student)


complete_df = pd.merge(schools_df,students_df,how = "left", on = ["school_name"])
complete_df.head()

,School ID,school_name,type,size,budget,Student ID,student_name,gender,grade,reading_score,math_score
0,0,Huang High School,District,2917,1910635,0,Paul Bradley,M,9th,66,79
1,0,Huang High School,District,2917,1910635,1,Victor Smith,M,12th,94,61
2,0,Huang High School,District,2917,1910635,2,Kevin Rodriguez,M,12th,90,60
3,0,Huang High School,District,2917,1910635,3,Dr. Richard Scott,M,12th,67,58
4,0,Huang High School,District,2917,1910635,4,Bonnie Ray,F,9th,97,84

In [86]:
total_school = complete_df["school_name"].unique().size
total_students = complete_df["Student ID"].unique().size
total_budgets = schools_df['budget'].sum()
average_math = complete_df["math_score"].mean()
average_read = complete_df["reading_score"].mean()
read_pass = 100* complete_df[complete_df["reading_score"]>=70].size /  complete_df.size
math_pass = 100* complete_df[complete_df["math_score"]>=70].size /complete_df.size
overall_pass = (math_pass + read_pass)/2

In [87]:
# District Summary
summary_df = pd.DataFrame({
    "Total Schools":[total_school], 
    "Total Students":[total_students],
    "Total Budget":['${:,.2f}'.format(total_budgets)],
    "Average Math Score":[average_math],
    "Average Reading Score":[average_read],
    "% Passing Math":[math_pass],
    "% Passing Reading":[read_pass],
    "% Overall Passing Rate":[overall_pass]
    
})

summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
0,15,39170,"$24,649,428.00",78.985371,81.87784,74.980853,85.805463,80.393158

In [88]:
# Create an overview table that summarizes key metrics about each school, including:
result = []

for name, group_school_df in complete_df.groupby('school_name'):
    
    total_students = group_school_df["Student ID"].unique().size
    total_budgets = group_school_df['budget'].unique()[0]
    per_student_budget = total_budgets/total_students
    average_math = group_school_df["math_score"].mean()
    average_read = group_school_df["reading_score"].mean()
    read_pass = 100* group_school_df[group_school_df["reading_score"]>=70].size /  group_school_df.size
    math_pass = 100* group_school_df[group_school_df["math_score"]>=70].size /group_school_df.size
    overall_pass = (read_pass + math_pass)/2

    summary2_df = pd.DataFrame({
        #"school_name": name,
        "School Type": group_school_df['type'].unique()[0],
        "Total Students":[total_students],
        "Total Budget":[total_budgets],
        "Per Student Budget":[per_student_budget],
        "Average Math Score":[average_math],
        "Average Reading Score":[average_read],
        "% Passing Math":[math_pass],
        "% Passing Reading":[read_pass],
        "% Overall Passing Rate":[overall_pass]
    }, index=[name])
    result.append(summary2_df)

#Create a dataframe to hold the above results    
school_summary_result_df = pd.concat(result)
#school_summary_result_df.set_index('school_name', inplace = True)
final_df = school_summary_result_df.copy()
final_df['Total Budget']=final_df['Total Budget'].map('${:,.2f}'.format)
final_df['Per Student Budget']= final_df['Per Student Budget'].map('${:,.2f}'.format)
final_df

,School Type,Total Students,Total Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
Bailey High School,District,4976,"$3,124,928.00",$628.00,77.048432,81.033963,66.680064,81.933280,74.306672
Cabrera High School,Charter,1858,"$1,081,356.00",$582.00,83.061895,83.975780,94.133477,97.039828,95.586652
Figueroa High School,District,2949,"$1,884,411.00",$639.00,76.711767,81.158020,65.988471,80.739234,73.363852
Ford High School,District,2739,"$1,763,916.00",$644.00,77.102592,80.746258,68.309602,79.299014,73.804308
Griffin High School,Charter,1468,"$917,500.00",$625.00,83.351499,83.816757,93.392371,97.138965,95.265668
Hernandez High School,District,4635,"$3,022,020.00",$652.00,77.289752,80.934412,66.752967,80.862999,73.807983
Holden High School,Charter,427,"$248,087.00",$581.00,83.803279,83.814988,92.505855,96.252927,94.379391
Huang High School,District,2917,"$1,910,635.00",$655.00,76.629414,81.182722,65.683922,81.316421,73.500171
Johnson High School,District,4761,"$3,094,650.00",$650.00,77.072464,80.966394,66.057551,81.222432,73.639992
Pena High School,Charter,962,"$585,858.00",$609.00,83.839917,84.044699,94.594595,95.945946,95.270270
Rodriguez High School,District,3999,"$2,547,363.00",$637.00,76.842711,80.744686,66.366592,80.220055,73.293323
Shelton High School,Charter,1761,"$1,056,600.00",$600.00,83.359455,83.725724,93.867121,95.854628,94.860875
Thomas High School,Charter,1635,"$1,043,130.00",$638.00,83.418349,83.848930,93.272171,97.308869,95.290520
Wilson High School,Charter,2283,"$1,319,574.00",$578.00,83.274201,83.989488,93.867718,96.539641,95.203679
Wright High School,Charter,1800,"$1,049,400.00",$583.00,83.682222,83.955000,93.333333,96.611111,94.972222

In [89]:
# Top Performing Schools (By Passing Rate)
top_5_school_df = school_summary_result_df.sort_values("% Overall Passing Rate", ascending = False).head(5)
top_5_school_df

,School Type,Total Students,Total Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
Cabrera High School,Charter,1858,1081356,582.0,83.061895,83.975780,94.133477,97.039828,95.586652
Thomas High School,Charter,1635,1043130,638.0,83.418349,83.848930,93.272171,97.308869,95.290520
Pena High School,Charter,962,585858,609.0,83.839917,84.044699,94.594595,95.945946,95.270270
Griffin High School,Charter,1468,917500,625.0,83.351499,83.816757,93.392371,97.138965,95.265668
Wilson High School,Charter,2283,1319574,578.0,83.274201,83.989488,93.867718,96.539641,95.203679

In [90]:
# Bottom Performing Schools (By Passing Rate)
bottom_5_school_df = school_summary_result_df.sort_values("% Overall Passing Rate", ascending = True).head(5)
bottom_5_school_df

,School Type,Total Students,Total Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
Rodriguez High School,District,3999,2547363,637.0,76.842711,80.744686,66.366592,80.220055,73.293323
Figueroa High School,District,2949,1884411,639.0,76.711767,81.158020,65.988471,80.739234,73.363852
Huang High School,District,2917,1910635,655.0,76.629414,81.182722,65.683922,81.316421,73.500171
Johnson High School,District,4761,3094650,650.0,77.072464,80.966394,66.057551,81.222432,73.639992
Ford High School,District,2739,1763916,644.0,77.102592,80.746258,68.309602,79.299014,73.804308

In [91]:
# Create a table that lists the average Math Score for students of each grade level (9th, 10th, 11th, 12th) at each school.
ninth = complete_df[complete_df["grade"] == "9th"]
tenth = complete_df[complete_df["grade"] == "10th"]
eleventh = complete_df[complete_df["grade"] == "11th"]
twelveth = complete_df[complete_df["grade"] == "12th"]

nine = pd.Series(ninth['math_score'].values,index=ninth['school_name'], name = "9th")
group_nine = nine.groupby('school_name').mean()
ten = pd.Series(tenth['math_score'].values,index=tenth['school_name'], name = "10th")
group_ten = ten.groupby('school_name').mean()
eleven = pd.Series(eleventh['math_score'].values,index=eleventh['school_name'], name = "11th")
group_eleven = eleven.groupby('school_name').mean()
twelve = pd.Series(twelveth['math_score'].values,index=twelveth['school_name'], name = "12th")
group_twelve = twelve.groupby('school_name').mean()

#test = pd.merge(group_nine,group_ten, groupon = ["school_name"])
#test.head()
math_score_df = pd.concat([group_nine, group_ten, group_eleven,group_twelve], axis=1)
math_score_df

                             9th       10th       11th       12th
school_name
Bailey High School     77.083676  76.996772  77.515588  76.492218
Cabrera High School    83.094697  83.154506  82.765560  83.277487
Figueroa High School   76.403037  76.539974  76.884344  77.151369
Ford High School       77.361345  77.672316  76.918058  76.179963
Griffin High School    82.044010  84.229064  83.842105  83.356164
Hernandez High School  77.438495  77.337408  77.136029  77.186567
Holden High School     83.787402  83.429825  85.000000  82.855422
Huang High School      77.027251  75.908735  76.446602  77.225641
Johnson High School    77.187857  76.691117  77.491653  76.863248
Pena High School       83.625455  83.372000  84.328125  84.121547
Rodriguez High School  76.859966  76.612500  76.395626  77.690748
Shelton High School    83.420755  82.917411  83.383495  83.778976
Thomas High School     83.590022  83.087886  83.498795  83.497041
Wilson High School     83.085578  83.724422  83.195326  83.035794
Wright High School     83.264706  84.010288  83.836782  83.644986

In [92]:
# Create a table that lists the average Reading Score for students of each grade level (9th, 10th, 11th, 12th) at each school.

nine2 = pd.Series(ninth['reading_score'].values,index=ninth['school_name'], name = "9th")
group_nine2 = nine2.groupby('school_name').mean()
ten2 = pd.Series(tenth['reading_score'].values,index=tenth['school_name'], name = "10th")
group_ten2 = ten2.groupby('school_name').mean()
eleven2 = pd.Series(eleventh['reading_score'].values,index=eleventh['school_name'], name = "11th")
group_eleven2 = eleven2.groupby('school_name').mean()
twelve2 = pd.Series(twelveth['reading_score'].values,index=twelveth['school_name'], name = "12th")
group_twelve2 = twelve2.groupby('school_name').mean()

#test = pd.merge(group_nine,group_ten, groupon = ["school_name"])
#test.head()
reading_score_df = pd.concat([group_nine2, group_ten2, group_eleven2,group_twelve2], axis=1)
reading_score_df

                             9th       10th       11th       12th
school_name
Bailey High School     81.303155  80.907183  80.945643  80.912451
Cabrera High School    83.676136  84.253219  83.788382  84.287958
Figueroa High School   81.198598  81.408912  80.640339  81.384863
Ford High School       80.632653  81.262712  80.403642  80.662338
Griffin High School    83.369193  83.706897  84.288089  84.013699
Hernandez High School  80.866860  80.660147  81.396140  80.857143
Holden High School     83.677165  83.324561  83.815534  84.698795
Huang High School      81.290284  81.512386  81.417476  80.305983
Johnson High School    81.260714  80.773431  80.616027  81.227564
Pena High School       83.807273  83.612000  84.335938  84.591160
Rodriguez High School  80.993127  80.629808  80.864811  80.376426
Shelton High School    84.122642  83.441964  84.373786  82.781671
Thomas High School     83.728850  84.254157  83.585542  83.831361
Wilson High School     83.939778  84.021452  83.764608  84.317673
Wright High School     83.833333  83.812757  84.156322  84.073171

In [96]:
#Create a table that breaks down school performances based on average Spending Ranges (Per Student). 

spending_bins = [0, 585, 615, 645, 675]
group_names = ["<$585", "$585-615", "$615-645", "$645-675"]

school_summary_result_df['Spending Ranges'] = pd.cut(school_summary_result_df["Per Student Budget"], spending_bins, labels=group_names, include_lowest=True)
new_df = school_summary_result_df.groupby('Spending Ranges')
new_df = new_df.mean()
new_df = new_df[['Average Math Score','Average Reading Score','% Passing Math', "% Passing Reading",'% Overall Passing Rate']]
new_df

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
Spending Ranges,,,,,
<$585,83.455399,83.933814,93.460096,96.610877,95.035486
$585-615,83.599686,83.885211,94.230858,95.900287,95.065572
$615-645,79.079225,81.891436,75.668212,86.106569,80.887391
$645-675,76.997210,81.027843,66.164813,81.133951,73.649382

In [97]:
# Perform the same operations as above, based on school size.
size_bins = [0, 1000, 2000, 5000]
group_names = ["Small (<1000)", "Medium (1000-2000)", "Large (2000-5000)"]

school_summary_result_df['School Sizes'] = pd.cut(school_summary_result_df["Total Students"], size_bins, labels=group_names, include_lowest=True)
new_df = school_summary_result_df.groupby('School Sizes')
new_df = new_df.mean()
new_df = new_df[['Average Math Score','Average Reading Score','% Passing Math', "% Passing Reading",'% Overall Passing Rate']]
new_df

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
School Sizes,,,,,
Small (<1000),83.821598,83.929843,93.550225,96.099437,94.824831
Medium (1000-2000),83.374684,83.864438,93.599695,96.790680,95.195187
Large (2000-5000),77.746417,81.344493,69.963361,82.766634,76.364998

In [102]:
# Perform the same operations as above, based on school type

# type_bins = ["Charter", "District"]
# group_names = ["Charter", "District"]
# school_summary_result_df['School Type'] = pd.cut(school_summary_result_df["School Type"], type_bins, labels=group_names, include_lowest=True)
new_df = school_summary_result_df.groupby('School Type')
new_df = new_df.mean()
new_df = new_df[['Average Math Score','Average Reading Score','% Passing Math', "% Passing Reading",'% Overall Passing Rate']]
new_df

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
School Type,,,,,
Charter,83.473852,83.896421,93.620830,96.586489,95.103660
District,76.956733,80.966636,66.548453,80.799062,73.673757